
'''
Write a Python program to count the number of even and odd numbers from a series of numbers. 

أكتب برنامج يعد كم عدد زوجي وكم عدد فردي بين الاعداد 0 الى 10 


Output : 
Number of even numbers : 6
Number of odd numbers : 5

'''




#------------------ @start:zaid------------------------------



#-------------------- @end:zaid------------------------------



#------------------ @start:hadeel------------------------------



#-------------------- @end:hadeel------------------------------




#------------------ @start:khalid------------------------------



#-------------------- @end:khalid------------------------------



#------------------ @start:عبدالرحمن------------------------------



#-------------------- @end:عبدالرحمن------------------------------


#------------------ @start:ممدوح------------------------------



#-------------------- @end:ممدوح------------------------------








